<template>
  <div class="schedule">
    <div class="container">
      <div class="grid">
        <header class="top">
          <h2 class="top__title">Расписание</h2>
        </header>
        <section class="slider">
          <svg class="slider__left" width="6" height="10" viewBox="0 0 6 10" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M5.74688 0.246261C5.66733 0.168229 5.57268 0.106294 5.46841 0.0640274C5.36413 0.021761 5.25228 0 5.13931 0C5.02635 0 4.9145 0.021761 4.81022 0.0640274C4.70594 0.106294 4.6113 0.168229 4.53175 0.246261L0.253122 4.4089C0.172916 4.4863 0.109255 4.57838 0.0658112 4.67983C0.0223672 4.78128 0 4.8901 0 5C0 5.1099 0.0223672 5.21872 0.0658112 5.32017C0.109255 5.42162 0.172916 5.5137 0.253122 5.5911L4.53175 9.75374C4.6113 9.83177 4.70594 9.89371 4.81022 9.93597C4.9145 9.97824 5.02635 10 5.13931 10C5.25228 10 5.36413 9.97824 5.46841 9.93597C5.57268 9.89371 5.66733 9.83177 5.74688 9.75374C5.82708 9.67634 5.89074 9.58427 5.93419 9.48281C5.97763 9.38136 6 9.27255 6 9.16264C6 9.05274 5.97763 8.94392 5.93419 8.84247C5.89074 8.74102 5.82708 8.64894 5.74688 8.57155L2.06726 5L5.74688 1.42845C5.82708 1.35106 5.89074 1.25898 5.93419 1.15753C5.97763 1.05608 6 0.94726 6 0.837356C6 0.727452 5.97763 0.618636 5.93419 0.517185C5.89074 0.415733 5.82708 0.323655 5.74688 0.246261Z" fill="#1E1E1E"/>
          </svg>
          <div class="slider__day slider__day-prev-active">
            <p class="slider__day-date">05</p>
            <h2 class="slider__day-week">Пн</h2>
          </div>
          <div class="slider__day">
            <p class="slider__day-date">06</p>
            <h2 class="slider__day-week">Вт</h2>
          </div>
          <div class="slider__day">
            <p class="slider__day-date">07</p>
            <h2 class="slider__day-week">Ср</h2>
          </div>
          <div class="slider__day">
            <p class="slider__day-date">08</p>
            <h2 class="slider__day-week">Чт</h2>
          </div>
          <div class="slider__day">
            <p class="slider__day-date">09</p>
            <h2 class="slider__day-week">Пт</h2>
          </div>
          <div class="slider__day slider__day-active">
            <p class="slider__day-date">10</p>
            <h2 class="slider__day-week">Сб</h2>
          </div>
          <svg class="slider__right" width="6" height="10" viewBox="0 0 6 10" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M0.253122 0.246261C0.332673 0.168229 0.427317 0.106294 0.531595 0.0640274C0.635873 0.021761 0.747721 0 0.860687 0C0.973653 0 1.0855 0.021761 1.18978 0.0640274C1.29406 0.106294 1.3887 0.168229 1.46825 0.246261L5.74688 4.4089C5.82708 4.4863 5.89074 4.57838 5.93419 4.67983C5.97763 4.78128 6 4.8901 6 5C6 5.1099 5.97763 5.21872 5.93419 5.32017C5.89074 5.42162 5.82708 5.5137 5.74688 5.5911L1.46825 9.75374C1.3887 9.83177 1.29406 9.89371 1.18978 9.93597C1.0855 9.97824 0.973653 10 0.860687 10C0.747721 10 0.635873 9.97824 0.531595 9.93597C0.427317 9.89371 0.332673 9.83177 0.253122 9.75374C0.172916 9.67634 0.109255 9.58427 0.0658112 9.48281C0.022367 9.38136 0 9.27255 0 9.16264C0 9.05274 0.022367 8.94392 0.0658112 8.84247C0.109255 8.74102 0.172916 8.64894 0.253122 8.57155L3.93274 5L0.253122 1.42845C0.172916 1.35106 0.109255 1.25898 0.0658112 1.15753C0.022367 1.05608 0 0.94726 0 0.837356C0 0.727452 0.022367 0.618636 0.0658112 0.517185C0.109255 0.415733 0.172916 0.323655 0.253122 0.246261Z" fill="#1E1E1E"/>
          </svg>
        </section>
        <section class="name">
          <h1 class="name__title">ПИ2303</h1>
          <strong class="name__slash">|</strong>
          <h2 class="name__week">Неделя 2</h2>
        </section>
        <section class="search">
          <input class="search__input" type="text" placeholder="Группа, преподаватель, аудитория">
          <svg class="search__loupe" width="13" height="13" viewBox="0 0 13 13" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M1.46466 1.40156C1.00031 1.86591 0.631959 2.41718 0.380652 3.02389C0.129346 3.6306 6.91942e-09 4.28086 0 4.93756C-6.91942e-09 5.59426 0.129346 6.24452 0.380652 6.85123C0.631959 7.45794 1.00031 8.0092 1.46466 8.47356C1.92901 8.93791 2.48028 9.30626 3.08699 9.55757C3.6937 9.80887 4.34396 9.93822 5.00066 9.93822C5.65736 9.93822 6.30762 9.80887 6.91433 9.55757C7.52104 9.30626 8.0723 8.93791 8.53666 8.47356C9.44745 7.53055 9.95142 6.26754 9.94003 4.95655C9.92864 3.64557 9.40279 2.39151 8.47575 1.46447C7.54871 0.537426 6.29465 0.0115811 4.98366 0.000189013C3.67268 -0.0112031 2.40967 0.492769 1.46666 1.40356M7.83066 7.76756C7.46074 8.14579 7.01946 8.44687 6.53238 8.65339C6.04529 8.8599 5.52208 8.96773 4.99303 8.97065C4.46399 8.97356 3.93962 8.8715 3.45029 8.67036C2.96096 8.46922 2.51639 8.17302 2.14233 7.79889C1.76826 7.42476 1.47213 6.98014 1.27108 6.49077C1.07003 6.00141 0.968061 5.47702 0.971068 4.94797C0.974075 4.41893 1.082 3.89573 1.2886 3.40869C1.4952 2.92164 1.79637 2.48041 2.17466 2.11056C2.92767 1.37434 3.94064 0.964788 4.99374 0.970774C6.04683 0.976759 7.05508 1.3978 7.79968 2.14253C8.54428 2.88726 8.96514 3.89558 8.97094 4.94868C8.97674 6.00178 8.56701 7.01468 7.83066 7.76756Z" fill="white"/>
            <path d="M7.82859 9.20055C7.64108 9.01291 7.53579 8.75847 7.53589 8.4932C7.53598 8.22793 7.64145 7.97356 7.82909 7.78605C8.01673 7.59854 8.27117 7.49325 8.53644 7.49335C8.80172 7.49344 9.05608 7.59891 9.24359 7.78655L12.0716 10.6155C12.1671 10.7078 12.2433 10.8181 12.2957 10.9401C12.3481 11.0621 12.3757 11.1934 12.3768 11.3261C12.378 11.4589 12.3527 11.5906 12.3024 11.7135C12.2521 11.8364 12.1779 11.9481 12.084 12.0419C11.9901 12.1358 11.8784 12.2101 11.7555 12.2604C11.6326 12.3107 11.501 12.336 11.3682 12.3348C11.2354 12.3336 11.1042 12.3061 10.9822 12.2537C10.8602 12.2012 10.7498 12.1251 10.6576 12.0295L7.82859 9.20055Z" fill="white"/>
          </svg>

        </section>
        <section class="table">
          <h2 class="table__title">Суббота | 10 февраля</h2>
          <table class="table__content">
            <tbody>
            <tr class="table__content-row">
              <td class="table__content-row-time">08:00<br>09:30</td>
              <td class="table__content-row-color--seminar"></td>
              <td class="table__content-row-lesson">
                <span class="table__content-row-lesson--class">Веб-дизайн и интернет-программирование</span><br>
                <span class="table__content-row-lesson--teacher">ПИ2303/1 Лаптев С.В., ПИ2303/2 Чемарина А.В</span>
              </td>
              <td class="table__content-row-room">
                <span class="table__content-row-room--num">635гл</span>
                <br>
                <svg class="table__content-row-room-note" width="15" height="16" viewBox="0 0 15 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M12.3333 8.33333V6.33333C12.3333 4.13333 12.3333 3.03333 11.65 2.35C10.9667 1.66667 9.86667 1.66667 7.66667 1.66667H5.66667C3.46667 1.66667 2.36667 1.66667 1.68333 2.35C1 3.03333 1 4.13333 1 6.33333V9.66667C1 11.8667 1 12.9667 1.68333 13.65C2.36667 14.3333 3.46667 14.3333 5.66667 14.3333H6.66667M10 1V2.33333M6.66667 1V2.33333M3.33333 1V2.33333M8.33333 13C8.33333 13 9 13 9.66667 14.3333C9.66667 14.3333 11.7847 11 13.6667 10.3333M4 9.66667H6.66667M4 6.33333H9.33333" stroke="#3DB95E" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                </svg>

              </td>
            </tr>
            <tr class="table__content-row">
              <td class="table__content-row-time">09:45<br>11:15</td>
              <td class="table__content-row-color--lection"></td>
              <td class="table__content-row-lesson">
                <span class="table__content-row-lesson--class">Веб-дизайн и интернет-программирование</span><br>
                <span class="table__content-row-lesson--teacher">ПИ2303/1 Лаптев С.В., ПИ2303/2 Чемарина А.В</span>
              </td>
              <td class="table__content-row-room">
                <span class="table__content-row-room--num">635гл</span>
                <br>
                <svg class="table__content-row-room-note" width="15" height="16" viewBox="0 0 15 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M12.3333 8.33333V6.33333C12.3333 4.13333 12.3333 3.03333 11.65 2.35C10.9667 1.66667 9.86667 1.66667 7.66667 1.66667H5.66667C3.46667 1.66667 2.36667 1.66667 1.68333 2.35C1 3.03333 1 4.13333 1 6.33333V9.66667C1 11.8667 1 12.9667 1.68333 13.65C2.36667 14.3333 3.46667 14.3333 5.66667 14.3333H6.66667M10 1V2.33333M6.66667 1V2.33333M3.33333 1V2.33333M8.33333 13C8.33333 13 9 13 9.66667 14.3333C9.66667 14.3333 11.7847 11 13.6667 10.3333M4 9.66667H6.66667M4 6.33333H9.33333" stroke="#3DB95E" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                </svg>

              </td>
            </tr>
            <tr class="table__content-row">
              <td class="table__content-row-time">11:30<br>13:00</td>
              <td class="table__content-row-color--seminar"></td>
              <td class="table__content-row-lesson">
                <span class="table__content-row-lesson--class">Веб-дизайн и интернет-программирование</span><br>
                <span class="table__content-row-lesson--teacher">ПИ2303/1 Лаптев С.В., ПИ2303/2 Чемарина А.В</span>
              </td>
              <td class="table__content-row-room">
                <span class="table__content-row-room--num">635гл</span>
                <br>
                <svg class="table__content-row-room-note" width="15" height="16" viewBox="0 0 15 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M12.3333 8.33333V6.33333C12.3333 4.13333 12.3333 3.03333 11.65 2.35C10.9667 1.66667 9.86667 1.66667 7.66667 1.66667H5.66667C3.46667 1.66667 2.36667 1.66667 1.68333 2.35C1 3.03333 1 4.13333 1 6.33333V9.66667C1 11.8667 1 12.9667 1.68333 13.65C2.36667 14.3333 3.46667 14.3333 5.66667 14.3333H6.66667M10 1V2.33333M6.66667 1V2.33333M3.33333 1V2.33333M8.33333 13C8.33333 13 9 13 9.66667 14.3333C9.66667 14.3333 11.7847 11 13.6667 10.3333M4 9.66667H6.66667M4 6.33333H9.33333" stroke="#3DB95E" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                </svg>

              </td>
            </tr>
            <tr class="table__content-row">
              <td class="table__content-row-time">13:50<br>15:20</td>
              <td class="table__content-row-color--lection"></td>
              <td class="table__content-row-lesson">
                <span class="table__content-row-lesson--class">Веб-дизайн и интернет-программирование</span><br>
                <span class="table__content-row-lesson--teacher">ПИ2303/1 Лаптев С.В., ПИ2303/2 Чемарина А.В</span>
              </td>
              <td class="table__content-row-room">
                <span class="table__content-row-room--num">635гл</span>
                <br>
                <svg class="table__content-row-room-note" width="15" height="16" viewBox="0 0 15 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M12.3333 8.33333V6.33333C12.3333 4.13333 12.3333 3.03333 11.65 2.35C10.9667 1.66667 9.86667 1.66667 7.66667 1.66667H5.66667C3.46667 1.66667 2.36667 1.66667 1.68333 2.35C1 3.03333 1 4.13333 1 6.33333V9.66667C1 11.8667 1 12.9667 1.68333 13.65C2.36667 14.3333 3.46667 14.3333 5.66667 14.3333H6.66667M10 1V2.33333M6.66667 1V2.33333M3.33333 1V2.33333M8.33333 13C8.33333 13 9 13 9.66667 14.3333C9.66667 14.3333 11.7847 11 13.6667 10.3333M4 9.66667H6.66667M4 6.33333H9.33333" stroke="#3DB95E" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                </svg>

              </td>
            </tr>
            <tr class="table__content-row">
              <td class="table__content-row-time">15:35<br>17:05</td>
              <td class="table__content-row-color--seminar"></td>
              <td class="table__content-row-lesson">
                <span class="table__content-row-lesson--class">Веб-дизайн и интернет-программирование</span><br>
                <span class="table__content-row-lesson--teacher">ПИ2303/1 Лаптев С.В., ПИ2303/2 Чемарина А.В</span>
              </td>
              <td class="table__content-row-room">
                <span class="table__content-row-room--num">635гл</span>
                <br>
                <svg class="table__content-row-room-note" width="15" height="16" viewBox="0 0 15 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M12.3333 8.33333V6.33333C12.3333 4.13333 12.3333 3.03333 11.65 2.35C10.9667 1.66667 9.86667 1.66667 7.66667 1.66667H5.66667C3.46667 1.66667 2.36667 1.66667 1.68333 2.35C1 3.03333 1 4.13333 1 6.33333V9.66667C1 11.8667 1 12.9667 1.68333 13.65C2.36667 14.3333 3.46667 14.3333 5.66667 14.3333H6.66667M10 1V2.33333M6.66667 1V2.33333M3.33333 1V2.33333M8.33333 13C8.33333 13 9 13 9.66667 14.3333C9.66667 14.3333 11.7847 11 13.6667 10.3333M4 9.66667H6.66667M4 6.33333H9.33333" stroke="#3DB95E" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                </svg>

              </td>
            </tr>
            <tr class="table__content-row">
              <td class="table__content-row-time">17:20<br>18:50</td>
              <td class="table__content-row-color--seminar"></td>
              <td class="table__content-row-lesson">
                <span class="table__content-row-lesson--class">Веб-дизайн и интернет-программирование</span><br>
                <span class="table__content-row-lesson--teacher">ПИ2303/1 Лаптев С.В., ПИ2303/2 Чемарина А.В</span>
              </td>
              <td class="table__content-row-room">
                <span class="table__content-row-room--num">635гл</span>
                <br>
                <svg class="table__content-row-room-note" width="15" height="16" viewBox="0 0 15 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M12.3333 8.33333V6.33333C12.3333 4.13333 12.3333 3.03333 11.65 2.35C10.9667 1.66667 9.86667 1.66667 7.66667 1.66667H5.66667C3.46667 1.66667 2.36667 1.66667 1.68333 2.35C1 3.03333 1 4.13333 1 6.33333V9.66667C1 11.8667 1 12.9667 1.68333 13.65C2.36667 14.3333 3.46667 14.3333 5.66667 14.3333H6.66667M10 1V2.33333M6.66667 1V2.33333M3.33333 1V2.33333M8.33333 13C8.33333 13 9 13 9.66667 14.3333C9.66667 14.3333 11.7847 11 13.6667 10.3333M4 9.66667H6.66667M4 6.33333H9.33333" stroke="#3DB95E" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                </svg>

              </td>
            </tr>

            </tbody>
          </table>
        </section>
        <section class="btns">
          <button class="btn">Полное расписание
            <span>
            <svg class="btn__full-sked" width="23" height="23" viewBox="0 0 23 23" fill="none" xmlns="http://www.w3.org/2000/svg">
              <g clip-path="url(#clip0_135_258)">
              <path d="M23 4.3125V20.125C23 20.8875 22.6971 21.6188 22.1579 22.1579C21.6188 22.6971 20.8875 23 20.125 23H2.875C2.1125 23 1.38124 22.6971 0.842068 22.1579C0.302901 21.6188 0 20.8875 0 20.125V2.875C0 2.1125 0.302901 1.38124 0.842068 0.842068C1.38124 0.302901 2.1125 0 2.875 0L20.125 0C20.8875 0 21.6188 0.302901 22.1579 0.842068C22.6971 1.38124 23 2.1125 23 2.875V4.3125ZM21.5625 4.3125V2.875C21.5625 2.49375 21.411 2.12812 21.1415 1.85853C20.8719 1.58895 20.5062 1.4375 20.125 1.4375H2.875C2.49375 1.4375 2.12812 1.58895 1.85853 1.85853C1.58895 2.12812 1.4375 2.49375 1.4375 2.875V4.3125H21.5625ZM21.5625 5.75H1.4375V20.125C1.4375 20.5062 1.58895 20.8719 1.85853 21.1415C2.12812 21.411 2.49375 21.5625 2.875 21.5625H20.125C20.5062 21.5625 20.8719 21.411 21.1415 21.1415C21.411 20.8719 21.5625 20.5062 21.5625 20.125V5.75ZM6.46875 8.625C6.65937 8.625 6.84219 8.70073 6.97698 8.83552C7.11177 8.97031 7.1875 9.15313 7.1875 9.34375C7.1875 9.53437 7.11177 9.71719 6.97698 9.85198C6.84219 9.98677 6.65937 10.0625 6.46875 10.0625H3.588C3.39738 10.0625 3.21456 9.98677 3.07977 9.85198C2.94498 9.71719 2.86925 9.53437 2.86925 9.34375C2.86925 9.15313 2.94498 8.97031 3.07977 8.83552C3.21456 8.70073 3.39738 8.625 3.588 8.625H6.46875ZM19.4062 8.625C19.5969 8.625 19.7797 8.70073 19.9145 8.83552C20.0493 8.97031 20.125 9.15313 20.125 9.34375C20.125 9.53437 20.0493 9.71719 19.9145 9.85198C19.7797 9.98677 19.5969 10.0625 19.4062 10.0625H10.7812C10.5906 10.0625 10.4078 9.98677 10.273 9.85198C10.1382 9.71719 10.0625 9.53437 10.0625 9.34375C10.0625 9.15313 10.1382 8.97031 10.273 8.83552C10.4078 8.70073 10.5906 8.625 10.7812 8.625H19.4062ZM6.46875 12.9375C6.65937 12.9375 6.84219 13.0132 6.97698 13.148C7.11177 13.2828 7.1875 13.4656 7.1875 13.6562C7.1875 13.8469 7.11177 14.0297 6.97698 14.1645C6.84219 14.2993 6.65937 14.375 6.46875 14.375H3.588C3.39738 14.375 3.21456 14.2993 3.07977 14.1645C2.94498 14.0297 2.86925 13.8469 2.86925 13.6562C2.86925 13.4656 2.94498 13.2828 3.07977 13.148C3.21456 13.0132 3.39738 12.9375 3.588 12.9375H6.46875ZM19.4062 12.9375C19.5969 12.9375 19.7797 13.0132 19.9145 13.148C20.0493 13.2828 20.125 13.4656 20.125 13.6562C20.125 13.8469 20.0493 14.0297 19.9145 14.1645C19.7797 14.2993 19.5969 14.375 19.4062 14.375H10.7812C10.5906 14.375 10.4078 14.2993 10.273 14.1645C10.1382 14.0297 10.0625 13.8469 10.0625 13.6562C10.0625 13.4656 10.1382 13.2828 10.273 13.148C10.4078 13.0132 10.5906 12.9375 10.7812 12.9375H19.4062ZM6.46875 17.25C6.65937 17.25 6.84219 17.3257 6.97698 17.4605C7.11177 17.5953 7.1875 17.7781 7.1875 17.9688C7.1875 18.1594 7.11177 18.3422 6.97698 18.477C6.84219 18.6118 6.65937 18.6875 6.46875 18.6875H3.588C3.39738 18.6875 3.21456 18.6118 3.07977 18.477C2.94498 18.3422 2.86925 18.1594 2.86925 17.9688C2.86925 17.7781 2.94498 17.5953 3.07977 17.4605C3.21456 17.3257 3.39738 17.25 3.588 17.25H6.46875ZM19.4062 17.25C19.5969 17.25 19.7797 17.3257 19.9145 17.4605C20.0493 17.5953 20.125 17.7781 20.125 17.9688C20.125 18.1594 20.0493 18.3422 19.9145 18.477C19.7797 18.6118 19.5969 18.6875 19.4062 18.6875H10.7812C10.5906 18.6875 10.4078 18.6118 10.273 18.477C10.1382 18.3422 10.0625 18.1594 10.0625 17.9688C10.0625 17.7781 10.1382 17.5953 10.273 17.4605C10.4078 17.3257 10.5906 17.25 10.7812 17.25H19.4062Z" fill="white"/>
              </g>
              <defs>
              <clipPath id="clip0_135_258">
              <rect width="23" height="23" fill="white"/>
              </clipPath>
              </defs>
            </svg>
          </span>
          </button>
          <button class="btn">Добавить заметку
            <span>
            <svg class="btn__note" width="23" height="25" viewBox="0 0 23 25" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M19.7895 13.65V10.2C19.7895 6.405 19.7895 4.5075 18.6566 3.32875C17.5237 2.15 15.7 2.15 12.0526 2.15H8.73684C5.08947 2.15 3.26579 2.15 2.13289 3.32875C1 4.5075 1 6.405 1 10.2V15.95C1 19.745 1 21.6425 2.13289 22.8212C3.26579 24 5.08947 24 8.73684 24H10.3947M15.9211 1V3.3M10.3947 1V3.3M4.86842 1V3.3M13.1579 21.7C13.1579 21.7 14.2632 21.7 15.3684 24C15.3684 24 18.8798 18.25 22 17.1M5.97368 15.95H10.3947M5.97368 10.2H14.8158" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
            </svg>
          </span>
          </button>
        </section>
        <footer class="footer">
          <div class="footer__sked">
            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
              <g clip-path="url(#clip0_192_5)">
                <path d="M24 5.3125V21.125C24 21.8875 23.6971 22.6188 23.1579 23.1579C22.6188 23.6971 21.8875 24 21.125 24H3.875C3.1125 24 2.38124 23.6971 1.84207 23.1579C1.3029 22.6188 1 21.8875 1 21.125V3.875C1 3.1125 1.3029 2.38124 1.84207 1.84207C2.38124 1.3029 3.1125 1 3.875 1L21.125 1C21.8875 1 22.6188 1.3029 23.1579 1.84207C23.6971 2.38124 24 3.1125 24 3.875V5.3125ZM22.5625 5.3125V3.875C22.5625 3.49375 22.411 3.12812 22.1415 2.85853C21.8719 2.58895 21.5062 2.4375 21.125 2.4375H3.875C3.49375 2.4375 3.12812 2.58895 2.85853 2.85853C2.58895 3.12812 2.4375 3.49375 2.4375 3.875V5.3125H22.5625ZM22.5625 6.75H2.4375V21.125C2.4375 21.5062 2.58895 21.8719 2.85853 22.1415C3.12812 22.411 3.49375 22.5625 3.875 22.5625H21.125C21.5062 22.5625 21.8719 22.411 22.1415 22.1415C22.411 21.8719 22.5625 21.5062 22.5625 21.125V6.75ZM7.46875 9.625C7.65937 9.625 7.84219 9.70073 7.97698 9.83552C8.11177 9.97031 8.1875 10.1531 8.1875 10.3438C8.1875 10.5344 8.11177 10.7172 7.97698 10.852C7.84219 10.9868 7.65937 11.0625 7.46875 11.0625H4.588C4.39738 11.0625 4.21456 10.9868 4.07977 10.852C3.94498 10.7172 3.86925 10.5344 3.86925 10.3438C3.86925 10.1531 3.94498 9.97031 4.07977 9.83552C4.21456 9.70073 4.39738 9.625 4.588 9.625H7.46875ZM20.4062 9.625C20.5969 9.625 20.7797 9.70073 20.9145 9.83552C21.0493 9.97031 21.125 10.1531 21.125 10.3438C21.125 10.5344 21.0493 10.7172 20.9145 10.852C20.7797 10.9868 20.5969 11.0625 20.4062 11.0625H11.7812C11.5906 11.0625 11.4078 10.9868 11.273 10.852C11.1382 10.7172 11.0625 10.5344 11.0625 10.3438C11.0625 10.1531 11.1382 9.97031 11.273 9.83552C11.4078 9.70073 11.5906 9.625 11.7812 9.625H20.4062ZM7.46875 13.9375C7.65937 13.9375 7.84219 14.0132 7.97698 14.148C8.11177 14.2828 8.1875 14.4656 8.1875 14.6562C8.1875 14.8469 8.11177 15.0297 7.97698 15.1645C7.84219 15.2993 7.65937 15.375 7.46875 15.375H4.588C4.39738 15.375 4.21456 15.2993 4.07977 15.1645C3.94498 15.0297 3.86925 14.8469 3.86925 14.6562C3.86925 14.4656 3.94498 14.2828 4.07977 14.148C4.21456 14.0132 4.39738 13.9375 4.588 13.9375H7.46875ZM20.4062 13.9375C20.5969 13.9375 20.7797 14.0132 20.9145 14.148C21.0493 14.2828 21.125 14.4656 21.125 14.6562C21.125 14.8469 21.0493 15.0297 20.9145 15.1645C20.7797 15.2993 20.5969 15.375 20.4062 15.375H11.7812C11.5906 15.375 11.4078 15.2993 11.273 15.1645C11.1382 15.0297 11.0625 14.8469 11.0625 14.6562C11.0625 14.4656 11.1382 14.2828 11.273 14.148C11.4078 14.0132 11.5906 13.9375 11.7812 13.9375H20.4062ZM7.46875 18.25C7.65937 18.25 7.84219 18.3257 7.97698 18.4605C8.11177 18.5953 8.1875 18.7781 8.1875 18.9688C8.1875 19.1594 8.11177 19.3422 7.97698 19.477C7.84219 19.6118 7.65937 19.6875 7.46875 19.6875H4.588C4.39738 19.6875 4.21456 19.6118 4.07977 19.477C3.94498 19.3422 3.86925 19.1594 3.86925 18.9688C3.86925 18.7781 3.94498 18.5953 4.07977 18.4605C4.21456 18.3257 4.39738 18.25 4.588 18.25H7.46875ZM20.4062 18.25C20.5969 18.25 20.7797 18.3257 20.9145 18.4605C21.0493 18.5953 21.125 18.7781 21.125 18.9688C21.125 19.1594 21.0493 19.3422 20.9145 19.477C20.7797 19.6118 20.5969 19.6875 20.4062 19.6875H11.7812C11.5906 19.6875 11.4078 19.6118 11.273 19.477C11.1382 19.3422 11.0625 19.1594 11.0625 18.9688C11.0625 18.7781 11.1382 18.5953 11.273 18.4605C11.4078 18.3257 11.5906 18.25 11.7812 18.25H20.4062Z" fill="#33984E"/>
              </g>
              <g clip-path="url(#clip1_192_5)">
                <path d="M23 4.3125V20.125C23 20.8875 22.6971 21.6188 22.1579 22.1579C21.6188 22.6971 20.8875 23 20.125 23H2.875C2.1125 23 1.38124 22.6971 0.842068 22.1579C0.302901 21.6188 0 20.8875 0 20.125V2.875C0 2.1125 0.302901 1.38124 0.842068 0.842068C1.38124 0.302901 2.1125 0 2.875 0L20.125 0C20.8875 0 21.6188 0.302901 22.1579 0.842068C22.6971 1.38124 23 2.1125 23 2.875V4.3125ZM21.5625 4.3125V2.875C21.5625 2.49375 21.411 2.12812 21.1415 1.85853C20.8719 1.58895 20.5062 1.4375 20.125 1.4375H2.875C2.49375 1.4375 2.12812 1.58895 1.85853 1.85853C1.58895 2.12812 1.4375 2.49375 1.4375 2.875V4.3125H21.5625ZM21.5625 5.75H1.4375V20.125C1.4375 20.5062 1.58895 20.8719 1.85853 21.1415C2.12812 21.411 2.49375 21.5625 2.875 21.5625H20.125C20.5062 21.5625 20.8719 21.411 21.1415 21.1415C21.411 20.8719 21.5625 20.5062 21.5625 20.125V5.75ZM6.46875 8.625C6.65937 8.625 6.84219 8.70073 6.97698 8.83552C7.11177 8.97031 7.1875 9.15313 7.1875 9.34375C7.1875 9.53437 7.11177 9.71719 6.97698 9.85198C6.84219 9.98677 6.65937 10.0625 6.46875 10.0625H3.588C3.39738 10.0625 3.21456 9.98677 3.07977 9.85198C2.94498 9.71719 2.86925 9.53437 2.86925 9.34375C2.86925 9.15313 2.94498 8.97031 3.07977 8.83552C3.21456 8.70073 3.39738 8.625 3.588 8.625H6.46875ZM19.4062 8.625C19.5969 8.625 19.7797 8.70073 19.9145 8.83552C20.0493 8.97031 20.125 9.15313 20.125 9.34375C20.125 9.53437 20.0493 9.71719 19.9145 9.85198C19.7797 9.98677 19.5969 10.0625 19.4062 10.0625H10.7812C10.5906 10.0625 10.4078 9.98677 10.273 9.85198C10.1382 9.71719 10.0625 9.53437 10.0625 9.34375C10.0625 9.15313 10.1382 8.97031 10.273 8.83552C10.4078 8.70073 10.5906 8.625 10.7812 8.625H19.4062ZM6.46875 12.9375C6.65937 12.9375 6.84219 13.0132 6.97698 13.148C7.11177 13.2828 7.1875 13.4656 7.1875 13.6562C7.1875 13.8469 7.11177 14.0297 6.97698 14.1645C6.84219 14.2993 6.65937 14.375 6.46875 14.375H3.588C3.39738 14.375 3.21456 14.2993 3.07977 14.1645C2.94498 14.0297 2.86925 13.8469 2.86925 13.6562C2.86925 13.4656 2.94498 13.2828 3.07977 13.148C3.21456 13.0132 3.39738 12.9375 3.588 12.9375H6.46875ZM19.4062 12.9375C19.5969 12.9375 19.7797 13.0132 19.9145 13.148C20.0493 13.2828 20.125 13.4656 20.125 13.6562C20.125 13.8469 20.0493 14.0297 19.9145 14.1645C19.7797 14.2993 19.5969 14.375 19.4062 14.375H10.7812C10.5906 14.375 10.4078 14.2993 10.273 14.1645C10.1382 14.0297 10.0625 13.8469 10.0625 13.6562C10.0625 13.4656 10.1382 13.2828 10.273 13.148C10.4078 13.0132 10.5906 12.9375 10.7812 12.9375H19.4062ZM6.46875 17.25C6.65937 17.25 6.84219 17.3257 6.97698 17.4605C7.11177 17.5953 7.1875 17.7781 7.1875 17.9688C7.1875 18.1594 7.11177 18.3422 6.97698 18.477C6.84219 18.6118 6.65937 18.6875 6.46875 18.6875H3.588C3.39738 18.6875 3.21456 18.6118 3.07977 18.477C2.94498 18.3422 2.86925 18.1594 2.86925 17.9688C2.86925 17.7781 2.94498 17.5953 3.07977 17.4605C3.21456 17.3257 3.39738 17.25 3.588 17.25H6.46875ZM19.4062 17.25C19.5969 17.25 19.7797 17.3257 19.9145 17.4605C20.0493 17.5953 20.125 17.7781 20.125 17.9688C20.125 18.1594 20.0493 18.3422 19.9145 18.477C19.7797 18.6118 19.5969 18.6875 19.4062 18.6875H10.7812C10.5906 18.6875 10.4078 18.6118 10.273 18.477C10.1382 18.3422 10.0625 18.1594 10.0625 17.9688C10.0625 17.7781 10.1382 17.5953 10.273 17.4605C10.4078 17.3257 10.5906 17.25 10.7812 17.25H19.4062Z" fill="white"/>
              </g>
              <defs>
                <clipPath id="clip0_192_5">
                  <rect width="23" height="23" fill="white" transform="translate(1 1)"/>
                </clipPath>
                <clipPath id="clip1_192_5">
                  <rect width="23" height="23" fill="white"/>
                </clipPath>
              </defs>
            </svg>


          </div>
          <div class="footer__note">
            <svg width="24" height="26" viewBox="0 0 24 26" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M20.7895 14.65V11.2C20.7895 7.405 20.7895 5.5075 19.6566 4.32875C18.5237 3.15 16.7 3.15 13.0526 3.15H9.73684C6.08947 3.15 4.26579 3.15 3.13289 4.32875C2 5.5075 2 7.405 2 11.2V16.95C2 20.745 2 22.6425 3.13289 23.8212C4.26579 25 6.08947 25 9.73684 25H11.3947M16.9211 2V4.3M11.3947 2V4.3M5.86842 2V4.3M14.1579 22.7C14.1579 22.7 15.2632 22.7 16.3684 25C16.3684 25 19.8798 19.25 23 18.1M6.97368 16.95H11.3947M6.97368 11.2H15.8158" stroke="#33984E" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
              <path d="M19.7895 13.65V10.2C19.7895 6.405 19.7895 4.5075 18.6566 3.32875C17.5237 2.15 15.7 2.15 12.0526 2.15H8.73684C5.08947 2.15 3.26579 2.15 2.13289 3.32875C1 4.5075 1 6.405 1 10.2V15.95C1 19.745 1 21.6425 2.13289 22.8212C3.26579 24 5.08947 24 8.73684 24H10.3947M15.9211 1V3.3M10.3947 1V3.3M4.86842 1V3.3M13.1579 21.7C13.1579 21.7 14.2632 21.7 15.3684 24C15.3684 24 18.8798 18.25 22 17.1M5.97368 15.95H10.3947M5.97368 10.2H14.8158" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
            </svg>
          </div>
          <div class="footer__double">
            <svg width="25" height="25" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M8 20V23C8 23.5523 8.44772 24 9 24H23C23.5523 24 24 23.5523 24 23V9C24 8.44772 23.5523 8 23 8H18H2M24 12H18M14 1V4M6 1V4M5 12H7M9 12H15M5 16H7M9 16H15M3 4H17C17.5523 4 18 4.44772 18 5V19C18 19.5523 17.5523 20 17 20H3C2.44772 20 2 19.5523 2 19V5C2 4.44772 2.44772 4 3 4Z" stroke="#33984E" stroke-width="1.5"/>
              <path d="M7 19V22C7 22.5523 7.44772 23 8 23H22C22.5523 23 23 22.5523 23 22V8C23 7.44772 22.5523 7 22 7H17H1M23 11H17M13 0V3M5 0V3M4 11H6M8 11H14M4 15H6M8 15H14M2 3H16C16.5523 3 17 3.44772 17 4V18C17 18.5523 16.5523 19 16 19H2C1.44772 19 1 18.5523 1 18V4C1 3.44772 1.44772 3 2 3Z" stroke="white" stroke-width="1.5"/>
            </svg>
          </div>

        </footer>
      </div>
    </div>
  </div>
</template>

<script>
export default {

}
  


</script>

<style lang="sass">
* 
  margin: 0
  padding: 0
  box-sizing: border-box


html 
  font-size: 62.5%


body 
  font-family: 'Roboto', sans-serif
  background-color: #212529
  color: #1E1E1E


.container 
  margin: 0 auto
  max-width: 30rem
  height: 64rem
  background-color: white
  position: relative
  z-index: 0


.grid 
  padding: 2rem 2rem 0 2rem


.top 
  margin-bottom: 2rem
  &__title 
    font-size: 1.6rem
    font-weight: 600
    letter-spacing: -2%
    line-height: 1.9rem
    text-align: center



.slider 
  display: flex
  width: 100%
  justify-content: space-between
  margin: 0 auto 1.5rem auto
  align-items: center
  &__day 
    justify-items: center
    cursor: pointer
    &-date 
      font-size: 0.8rem
      font-weight: 400
      line-height: 0.9rem
    &-week 
      font-size: 1.6rem
      font-weight: 400
      line-height: 1.9rem
    &-prev-active,
    &-active 
      background-color: #CFCFCF
      border-radius: 0.3rem
      padding: 0.4rem
      position: relative
      &:after 
        content: ''
        z-index: -1
        position: absolute
        bottom: -0.2rem
        right: -0.1rem
        width: 100%
        height: 100%
        border-radius: 0.3rem
        background-color: #ACACAC
    &-active 
      background-color: #3DB95E
      color: white
      &:after 
        background-color: #33984E
    

.name 
  display: flex
  gap: 0.5rem
  margin-bottom: 1.5rem
  align-items: center
  &__title,
  &__slash 
    font-size: 2.4rem
    font-weight: 400
    letter-spacing: -0.05rem
  &__week 
    font-size: 1.4rem
    font-weight: 400
    letter-spacing: -0.05rem


.search 
  display: flex
  flex-wrap: nowrap
  justify-content: space-between
  align-items: center
  margin-bottom: 1.5rem
  &__input 
    padding: 0.9rem 1rem
    border: solid 0.1rem #D9D9D9
    border-radius: 0.3rem
    width: 100%
    height: 3rem
    margin-right: 1rem
    &::placeholder 
      font-size: 1rem
      line-height: 1.2rem
      font-weight: 400
      color: #D9D9D9
  &__loupe
    position: relative
    background-color: #3DB95E
    border-radius: 0.3rem
    padding: 0.8rem
    width: 3rem
    height: 3rem
    display: flex
    align-items: center
    justify-content: center
    cursor: pointer
    &:after
      content: ''
      z-index: -1
      position: absolute
      bottom: -0.2rem
      right: -0.1rem
      width: 100%
      height: 100%
      border-radius: 0.3rem
      background-color: #33984E
  

.table 
  width: 100%
  min-height: 100%
  background-color: #D9D9D9
  border-radius: 0.3rem 0.3rem 0 0
  overflow: hidden
  margin-bottom: 1.5rem
  display: flex
  flex-direction: column
  &__title 
    font-size: 1.2rem
    font-weight: 400
    padding: 0.5rem 1rem
    background-color: #3DB95E
    color: white
  &__content 
    width: 100%
    border-collapse: collapse
    display: flex
    flex-direction: column
    &-row 
      position: relative
      display: flex
      width: 100%
      justify-content: space-between
      &-time 
        align-self: center
        padding: 1.5rem 0.5rem
        flex: 0 0 auto
      &-color--seminar 
        width: 0.75rem
        background-color: #D9D9D9
        flex: 0 0 auto
      &-color--lection 
        width: 0.75rem
        background-color: #FFAC52
        flex: 0 0 auto
      &-lesson 
        padding: 0.5rem 0.8rem
        flex: 1
        &--class 
          display: inline-block
          line-height: 1rem
          margin-bottom: 0.2rem
        &--teacher 
          color: #3DB95E
      &-room 
        align-self: flex-start
        text-align: center
        padding: 0.5rem 0.3rem 0.5rem 0
        flex: 0 0 auto
        &--num 
          letter-spacing: -0.03rem
        &-note 
          margin-top: 0.3rem
          cursor: pointer

    tr 
      height: 5rem
      background-color: white
      border: solid 0.1rem #D9D9D9
      margin-top: -0.1rem
    th,
    td 
      font-size: 0.8rem
      font-weight: 400


.btns 
  display: flex
  flex-wrap: nowrap
  justify-content: space-between
  gap: 1rem
.btn 
  position: relative
  min-width: 45%
  max-height: 3rem
  display: flex
  flex-wrap: nowrap
  font-size: 1rem
  font-weight: 400
  letter-spacing: -0.02rem
  align-items: center
  background-color: #3DB95E
  border: none
  border-radius: 0.3rem
  color: white
  padding: 0.7rem
  gap: 0.7rem
  justify-content: space-around
  cursor: pointer
  &:before
    content: ''
    position: absolute
    top: 0.2rem
    left: 0.1rem
    width: 100%
    height: 100%
    background-color: #33984E
    border-radius: 0.3rem
    z-index: -1
  &__full-sked 
    width: 1.3rem
  &__note 
    width: 1.4rem


.footer 
  background-color: #3DB95E
  position: absolute
  display: flex
  justify-content: space-around
  align-items: center
  bottom: 0
  left: 0
  right: 0
  height: 5rem
  width: 100%
  &__sked,
  &__note,
  &__double 
    position: relative
    cursor: pointer

</style>